In [6]:
import pandas as pd

In [10]:
df1 = pd.DataFrame()

In [11]:
df1

Empty DataFrame
Columns: []
Index: []

In [ ]:
{
    "key":"value",
    "key2":"value"
}

In [12]:
data_dictionary = {'Yes': [50, 21], 'No': [131, 2]}

In [13]:
data_dictionary

{'Yes': [50, 21], 'No': [131, 2]}

In [15]:
data_dictionary['Yes']

[50, 21]

In [16]:
data_dictionary['No']

[131, 2]

In [17]:
df2 = pd.DataFrame(data_dictionary)

In [18]:
df2

   Yes   No
0   50  131
1   21    2

In [20]:
data_dictionary2 = {'Yes': [50, 21], 'No': [131, 2],
                  "gender": ["male","female"]}

In [21]:
df3 = pd.DataFrame(data_dictionary2)

In [22]:
df3

   Yes   No  gender
0   50  131    male
1   21    2  female

In [23]:
data_dictionary3 = {'Yes': [50, 21,20], 'No': [131, 2,10 ]}

In [24]:
df4 = pd.DataFrame(data_dictionary3)

In [25]:
df4

   Yes   No
0   50  131
1   21    2
2   20   10

In [26]:
df5 = pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'],
                    'Sue': ['Pretty good.', 'Bland.']})
df5

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [28]:
# df.shape
df5.shape

(2, 2)

In [29]:
df4.shape

(3, 2)

In [30]:
series1 = pd.Series([1, 2, 3, 4, 5])

In [31]:
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [32]:
df6 = pd.DataFrame(series1)

In [33]:
df6

   0
0  1
1  2
2  3
3  4
4  5

In [34]:
series2 = pd.Series([30, 35, 40], 
          index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

In [37]:
series2

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [38]:
series2.index

Index(['2015 Sales', '2016 Sales', '2017 Sales'], dtype='object')

In [39]:
df7 = pd.DataFrame(series2)

In [40]:
df7

            Product A
2015 Sales         30
2016 Sales         35
2017 Sales         40

In [41]:
df7.shape

(3, 1)

In [42]:
df7.index

Index(['2015 Sales', '2016 Sales', '2017 Sales'], dtype='object')

In [44]:
df_survey = pd.read_csv("annual-enterprise-survey-2021-financial-year-provisional-csv.csv")

In [45]:
df_survey.shape

(41715, 10)

In [46]:
df_survey.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...

In [47]:
df_survey.tail()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
41710,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41711,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41712,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41713,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41714,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [48]:
df_survey.head(10)

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...
5,2021,Level 1,99999,All industries,Dollars (millions),H09,Interest and donations,Financial performance,"26,138",ANZSIC06 divisions A-S (excluding classes K633...
6,2021,Level 1,99999,All industries,Dollars (millions),H10,Indirect taxes,Financial performance,"6,991",ANZSIC06 divisions A-S (excluding classes K633...
7,2021,Level 1,99999,All industries,Dollars (millions),H11,Depreciation,Financial performance,"27,801",ANZSIC06 divisions A-S (excluding classes K633...
8,2021,Level 1,99999,All industries,Dollars (millions),H12,Salaries and wages paid,Financial performance,"123,620",ANZSIC06 divisions A-S (excluding classes K633...
9,2021,Level 1,99999,All industries,Dollars (millions),H13,Redundancy and severance,Financial performance,275,ANZSIC06 divisions A-S (excluding classes K633...

In [49]:
df_survey.tail(10)

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
41705,2013,Level 3,ZZ11,Food product manufacturing,Dollars (millions),H32,Current liabilities,Financial position,"10,212","ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41706,2013,Level 3,ZZ11,Food product manufacturing,Dollars (millions),H33,Other liabilities,Financial position,"2,220","ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41707,2013,Level 3,ZZ11,Food product manufacturing,Dollars,H34,Total income per employee count,Financial ratios,"523,700","ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41708,2013,Level 3,ZZ11,Food product manufacturing,Dollars,H35,Surplus per employee count,Financial ratios,"17,700","ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41709,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H36,Current ratio,Financial ratios,91,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41710,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41711,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41712,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41713,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41714,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [50]:
df_survey.sample()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
16294,2018,Level 4,GH131,"Furniture, Electrical and Hardware Retailing",Dollars (millions),H32,Current liabilities,Financial position,"2,876","ANZSIC06 groups G421, G422, and G423"

In [51]:
df_survey.sample(5)

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
18727,2017,Level 3,AA13,Dairy Cattle Farming,Dollars (millions),H09,Interest and donations,Financial performance,"1,575",ANZSIC06 group A016
13689,2019,Level 4,RS112,Sport and Recreation Activities,Dollars (millions),H21,Opening stocks,Financial performance,65,"ANZSIC06 groups R911, R912, and R913"
7933,2020,Level 3,KK13,Auxiliary Finance and Insurance Services,Dollars (millions),H04,Sales of goods and services,Financial performance,"6,687",ANZSIC06 groups K641 and K642
34575,2014,Level 4,FF112,Machinery and Equipment Wholesaling,Dollars (millions),H25,Current assets,Financial position,"7,571",ANZSIC06 groups F341 and F349
4445,2021,Level 4,RS113,Gambling Activities,Dollars (millions),H10,Indirect taxes,Financial performance,183,ANZSIC06 group R920

In [52]:
# column names of a dataframe
df_survey.columns

Index(['Year', 'Industry_aggregation_NZSIOC', 'Industry_code_NZSIOC',
       'Industry_name_NZSIOC', 'Units', 'Variable_code', 'Variable_name',
       'Variable_category', 'Value', 'Industry_code_ANZSIC06'],
      dtype='object')

In [53]:
# datatype of columns
df_survey.dtypes

Year                            int64
Industry_aggregation_NZSIOC    object
Industry_code_NZSIOC           object
Industry_name_NZSIOC           object
Units                          object
Variable_code                  object
Variable_name                  object
Variable_category              object
Value                          object
Industry_code_ANZSIC06         object
dtype: object

In [ ]:
backslash (\) and a forward slash (/).

In [ ]:
# use double backslash or  forward slash for file path seperator

In [54]:
df_xl = pd.read_excel("C:\Users\Md Rana Mahmud\Downloads\data\file_example_XLSX_5000.xlsx")

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (3302315025.py, line 1)

In [61]:
df_xl = pd.read_excel("C:\\Users\\Md Rana Mahmud\\Downloads\\data\\file_example_XLSX_5000.xlsx")

In [56]:
df_xl.head()

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468

In [57]:
df_xl.shape

(5000, 8)

In [58]:
df_xl2 = pd.read_excel("C:/Users/Md Rana Mahmud/Downloads/data/file_example_XLSX_5000.xlsx")

In [59]:
df_xl2.shape

(5000, 8)

In [62]:
df_xl2.head()

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468

In [63]:
df_xl3 = pd.read_excel("C:/Users/Md Rana Mahmud/Downloads/data/file_example_XLSX_5000.xlsx",
                      index_col = 0)

In [64]:
df_xl3.head()

  First Name  Last Name  Gender        Country  Age        Date    Id
1      Dulce      Abril  Female  United States   32  15/10/2017  1562
2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
3     Philip       Gent    Male         France   36  21/05/2015  2587
4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
5    Nereida    Magwood  Female  United States   58  16/08/2016  2468